Revit 2027 API
DesignToFabricationConverterResult Enumeration
 Possible results from invoking the DesignToFabricationConverter.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DesignToFabricationConverterResult
Public Enumeration DesignToFabricationConverterResult
public enum class DesignToFabricationConverterResult
type DesignToFabricationConverterResult
Members
Member name | Value | Description
PartialFailure | 1 |  Conversion contained partial failures and will need to be fixed manually.
Success | 0 |  Conversion was successful.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace